**Imports**

In [131]:
import pandas as pd

student_dropout_file = "STUDENT_DROPOUT.csv"

student_dropout_data = pd.read_csv(student_dropout_file, 
                                   sep=",",
                                   encoding="utf-8-sig",    #UTF-8-sig  :   All Languages
                                   #encoding="cp860",       #CP860      :   Portuguese
                                   #
                                   header=None, engine="python")


teacher_age_file = "TEACHER_AGE.csv"

teacher_age_data = pd.read_csv(teacher_age_file, sep=",",encoding="utf-8-sig", header=None, engine="python")

**STUDENT DATA EXAMPLE**

In [132]:
student_dropout_data.head()

,0,1,2,3,4,5,6,7,8
0,01. Ano,02. Nome Região (Portugal),03. Âmbito Geográfico,04. Filtro 1,05. Filtro 2,06. Filtro 3,07. Escala,08. Símbolo,09. Valor
1,1995,Portugal,NaN,Cursos Gerais,10º ano,NaN,NaN,NaN,28.6
2,1995,Portugal,NaN,Cursos Gerais,11º ano,NaN,NaN,NaN,9.6
3,1995,Portugal,NaN,Cursos Gerais,12º ano,NaN,NaN,NaN,30.1
4,1995,Portugal,NaN,Cursos Gerais,Total,NaN,NaN,NaN,21.5

**STUDENT DATA FILTER**

Keeping only the fields and the values we are interested.

In [133]:
mask = ((student_dropout_data.iloc[:, 3] == 'Total') &
    (student_dropout_data.iloc[:, 4] == 'Total'))

student_dropout_filtered = student_dropout_data.loc[mask]

student_dropout_filtered = student_dropout_filtered.iloc[:, [0, 1, 8]].copy()

student_dropout_filtered.columns = ["Year", "Region", "Student_Dropout_Value"]

student_dropout_filtered.head()

    Year    Region Student_Dropout_Value
12  1995  Portugal                  21.3
24  1996  Portugal                  33.1
36  1997  Portugal                  35.7
48  1998  Portugal                  35.6
60  1999  Portugal                  36.0

**TEACHER DATA EXAMPLE**

In [134]:
teacher_age_data.head()

,0,1,2,3,4,5,6,7,8
0,01. Ano,02. Nome Região (Portugal),03. Âmbito Geográfico,04. Filtro 1,05. Filtro 2,06. Filtro 3,07. Escala,08. Símbolo,09. Valor
1,1996,Portugal,NaN,Básico - 1º Ciclo,NaN,NaN,NaN,NaN,123.8
2,1996,Portugal,NaN,Básico - 2º Ciclo,NaN,NaN,NaN,x,NaN
3,1996,Portugal,NaN,Básico - 3º Ciclo e secundário,NaN,NaN,NaN,x,NaN
4,1996,Portugal,NaN,Educação Pré-Escolar,NaN,NaN,NaN,x,NaN

**TEACHER DATA FILTER**

Keeping only the fields and the values we are interested.

In [135]:
mask = (teacher_age_data.iloc[:, 3] == 'Básico - 3º Ciclo e secundário')

teacher_age_filtered = teacher_age_data.loc[mask]

teacher_age_filtered = teacher_age_filtered.iloc[:, [0, 1, 8]].copy()

teacher_age_filtered.columns = ["Year", "Region", "Teacher_Data_Value"]

teacher_age_filtered.head()

    Year    Region Teacher_Data_Value
3   1996  Portugal                NaN
7   1997  Portugal                NaN
11  1998  Portugal                NaN
15  1999  Portugal                NaN
19  2000  Portugal               34.8

**MERGE**

Merging datasets focusing on Year and Region. Outer mergin to make sure we aren't losing any data.

In [136]:
merged = pd.merge(
    student_dropout_filtered,
    teacher_age_filtered,
    on=["Year", "Region"],
    how='outer'
)

merged.to_csv("merged_dataset.csv", index=False, sep=",", encoding="utf-8-sig")

In [137]:
merged.head()

   Year    Region Student_Dropout_Value Teacher_Data_Value
0  1995  Portugal                  21.3                NaN
1  1996  Portugal                  33.1                NaN
2  1997  Portugal                  35.7                NaN
3  1998  Portugal                  35.6                NaN
4  1999  Portugal                  36.0                NaN